# Question 1 Part 1
- Use ‘vehicle_collisions’ data set
- For each month in 2016, find out the percentage of collisions in Manhattan out of that year's total accidents in New York City
- Display a few rows of the output use df.head()
- Generate a csv output with four columns (‘Month’, ‘Manhattan’, ‘NYC’, ‘Percentage’)

In [58]:
import pandas as pd

In [59]:
df = pd.read_csv('Data/vehicle_collisions.csv')

In [60]:
df = df[df.apply(lambda x: x['DATE'].split('/')[2] == '16', axis=1)]

In [61]:
total_count = df['DATE'].apply(lambda x: x.split('/')[0]).value_counts()

In [62]:
df_manhattan = df[df.apply(lambda x: x['BOROUGH'] == 'MANHATTAN', axis=1)]
manhattan_count = df_manhattan['DATE'].apply(lambda x: x.split('/')[0]).value_counts()

In [63]:
output = pd.concat([manhattan_count, total_count], axis=1)
output.columns = ['MANHATTAN', 'NYC']
output.columns.name = 'MONTH'
output.index = output.index.map(int)
output.sort_index(inplace=True)
output.head(3)

MONTH  MANHATTAN    NYC
1           3178  18101
2           3195  15985
3           3479  18471

In [64]:
output = output.append(output.sum(numeric_only=True), ignore_index=True)
output

MONTH  MANHATTAN     NYC
0           3178   18101
1           3195   15985
2           3479   18471
3           3540   18331
4           3432   20052
5           2956   19433
6           3055   19867
7           2844   19678
8           2744   19492
9           2831   19666
10          2838   19315
11          2634   19214
12         36726  227605

In [65]:
output['PERCENTAGE'] = output['MANHATTAN']/output['NYC']
output = output.rename(index={0: 'Jan', 1: 'Feb', 2: 'Mar', 3: 'Apr', 4: 'May', 5: 'Jun', 6: 'Jul', 7: 'Aug', 8: 'Sep', 9: 'Oct', 10: 'Nov', 11: 'Dec', 12: 'Total'})
#output.head(3)

In [66]:
print(output.head(3))
output.to_csv('Ass3_output/Q1_P1_output.csv',index=True,header=True,index_label='MONTH')

MONTH  MANHATTAN    NYC  PERCENTAGE
Jan         3178  18101    0.175570
Feb         3195  15985    0.199875
Mar         3479  18471    0.188349